{"title":"Learn React Hooks: Build and refactor modern React.js applications using Hooks","authors":"Daniel Bugl","publisher":"Packt Publishing Ltd","categories":"Computers","pageCount":426,"imageLink":"https://books.google.com/books/content?id=Tkm4DwAAQBAJ&printsec=frontcover&img=1&zoom=10&edge=curl&source=gbs_api","description":"Create large-scale web applications with code that is extensible and easy to understand using React Hooks Key Features Explore effective strategies for migrating your state management from Redux and MobX to React Hooks Integrate Hooks with React features such as Context and Suspense to add advanced functionality to your web apps Create complex applications by combining multiple hooks Book Description React Hooks revolutionize how you manage state and effects in your web applications. They enable you to build simple and concise React.js applications, along with helping you avoid using wrapper components in your applications, making it easy to refactor code. This React book starts by introducing you to React Hooks. You will then get to grips with building a complex UI in React while keeping the code simple and extensible. Next, you will quickly move on to building your first applications with React Hooks. In the next few chapters, the book delves into various Hooks, including the State and Effect Hooks. After covering State Hooks and understanding how to use them, you will focus on the capabilities of Effect Hooks for adding advanced functionality to React apps. You will later explore the Suspense and Context APIs and how they can be used with Hooks. Toward the concluding chapters, you will learn how to integrate Redux and MobX with React Hooks. Finally, the book will help you develop the skill of migrating your existing React class components, and Redux and MobX web applications to Hooks. By the end of this book, you will be well-versed in building your own custom Hooks and effectively refactoring your React applications. What you will learn Understand the fundamentals of React Hooks and how they modernize state management in React apps Build your own custom Hooks and learn how to test them Use community Hooks for implementing responsive design and more Learn the limitations of Hooks and what you should and shouldn’t use them for Get to grips with implementing React context using Hooks Refactor your React-based web application, replacing existing React class components with Hooks Use state management solutions such as Redux and MobX with React Hooks Who this book is for This book is for React developers who want to learn how to build applications with Hooks. Developers who are looking to migrate to React for its advanced feature set and capabilities will also find the book useful."}